fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитовОтВидаДоговора();	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("КонецДействияДоговора", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
				
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитовОтВидаДоговора();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьРеквизитовОтВидаДоговора()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Элементы.НачалоДействияДоговора.Видимость = Истина;
		Элементы.КонецДействияДоговора.Видимость = Истина;
		Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе
		
		Элементы.НачалоДействияДоговора.Видимость = Ложь;
		Элементы.КонецДействияДоговора.Видимость = Ложь;
		Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
